---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetSetIterator Properties
AssetSetIterator Class See Also Send Feedback
---

The AssetSetIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current |  |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also

AssetSetIterator Class

Autodesk.Revit.DB.Visual Namespace